
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧитательскиеБилеты.Код КАК Код
	|ИЗ
	|	Справочник.ЧитательскиеБилеты КАК ЧитательскиеБилеты
	|ГДЕ
	|	ЧитательскиеБилеты.Владелец.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	ТекЗапись = РегистрыСведений.СрокЧитательскогоБилета.СоздатьНаборЗаписей();
	ТекЗапись.Прочитать();
	Для Каждого Запись Из ТекЗапись Цикл 
		Запись.СрокДействия = ДобавитьМесяц(Запись.СрокДействия, 12);
		ТекЗапись.Записать(Истина);
	КонецЦикла;
КонецПроцедуры
